# print("Hello world")
# напишите программу которая считывает.
# строку - разделитель и три строки, а затем выводит указанные строки через разделитель.
# a = input()
# b = input()
# c = input()
# d = input()
# print(b, c, d, sep=a)


# Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек),
# после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.
# user = input()
# print("Привет, ", user.capitalize(), end="!")


# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
# Первое число вводит пользователь, остальные числа вычисляются в программе.
# user = int(input())
# print(user, user + 1, user + 2, sep="\n")


# Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
# Каждое число записано в отдельной строке.
# user_1, user_2, user_3 = int(input()), int(input()), int(input())
# print((user_1 + user_2 + user_3))


# Напишите программу, вычисляющую объём куба и площадь его полной поверхности,
# по введённому значению длины ребра.
# Примечание 1. Объём куба и площадь полной поверхности можно вычислить по формулам
# user = int(input())
# cube_volume = user ** 3
# total_surface_area = 6 * (user ** 2)
# print(f"Объём куда = {cube_volume}\nПлощадь полной поверхности = {total_surface_area}")


# Напишите программу вычисления значения функции (даётся формула)
# a = int(input())
# b = int(input())
# f = 3 * (a + b) ** 3 + 275 * b ** 2 - 127 * a - 41
# print(f)


# Напишите программу, которая считывает целое число
# после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.
# user = int(input())
# print(f"Следующее за числом {user} число: {user + 1}")
# print(f"Для числа {user} предыдущее число: {user - 1}")


# Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора
# системного блока, клавиатуры и мыши. На вход программе подаётся четыре целых числа
# каждое на отдельной строке
# В первой строке — стоимость монитора, во второй строке — стоимость системного блока,
# в третьей строке — стоимость клавиатуры и в четвертой строке — стоимость мыши.
# monitor_price = int(input())
# case_price = int(input())
# keyboard_price = int(input())
# mouse_price = int(input())
# total_price = monitor_price + case_price + keyboard_price + mouse_price
# print(f"{total_price * 3}")

# Напишите программу, в которой вычисляется сумма, разность и произведение двух целых чисел, в
# веденных с клавиатуры.
# a, b = int(input()), int(input())
# print(f"{a} + {b} = {a + b}\n{a} - {b} = {a - b}\n{a} * {b} = {a * b}")

# Напишите программу, которая считывает целое положительное число x и выводит на экран последовательность чисел
# x*2, x*3, x*4, x*5, разделённых тремя черточками

# user = int(input())
# print(user, user * 2, user * 3, user * 4, user * 5, sep="---")

# Напишите программу, которая находит полное число метров по заданному числу сантиметров.
# user_cm = input()
# print(int(user_cm) // 100)

# n школьников делят  k мандаринов поровну, неделящийся остаток остается в корзине.
# Сколько целых мандаринов достанется каждому школьнику? Сколько целых мандаринов останется в корзине?
# schoolboy_count = int(input())
# mandarins_count = int(input())
# print(f"{mandarins_count // schoolboy_count}\n{mandarins_count % schoolboy_count}")


# Безумный титан Танос собрал все 6 камней бесконечности и намеревается уничтожить половину населения
# Вселенной по щелчку пальцев. При этом если население Вселенной является нечетным числом,
# то титан проявит милосердие и округлит количество выживших в большую сторону.
# Помогите Мстителям подсчитать количество выживших.
# n = int(input())
# print(n // 2 + n % 2)


# Напишите программу для пересчёта величины временного интервала
# заданного в минутах, в величину, выраженную в часах и минутах.

# minutes = int(input())
# hours = minutes // 60
# if hours == 0:
#     print(f"{minutes} мин - это {hours} часов {minutes % 60} минут.")
# elif hours == 1:
#     print(f"{minutes} мин - это {hours} час {minutes % 60} минут.")
# elif 2 <= hours < 5:
#     print(f"{minutes} мин - это {hours} часа {minutes % 60} минут.")
# else:
#     print(f"{minutes} мин - это {hours} часов {minutes % 60} минут.")


# Напишите программу, в которой рассчитывается сумма и произведение цифр положительного трёхзначного числа.

# num = int(input())
# num_1 = num // 100
# num_2 = (num // 10) % 10
# num_3 = num % 10
# summ = num_1 + num_2 + num_3
# mult = num_1 * num_2 * num_3
# print(f"Сумма цифр = {summ}")
# print(f"Произведение цифр = {mult}")


# Дано трехзначное число abc, в котором все цифры различны. Напишите программу, которая выводит шесть чисел
# образованных при перестановке цифр заданного числа.

# num = int(input())
# num_1 = num // 100
# num_2 = (num // 10) % 10
# num_3 = num % 10
# print(num_1, num_2, num_3, sep="")
# print(num_1, num_3, num_2, sep="")
# print(num_2, num_1, num_3, sep="")
# print(num_2, num_3, num_1, sep="")
# print(num_3, num_1, num_2, sep="")
# print(num_3, num_2, num_1, sep="")

# Напишите программу для нахождения цифр четырёхзначного числа.

# num = int(input())
# num_1 = num // 1000
# num_2 = (num // 100) % 10
# num_3 = (num % 100) // 10
# num_4 = (num % 100) % 10
# print(f"Цифра в позиции тысяч равна {num_1}")
# print(f"Цифра в позиции сотен равна {num_2}")
# print(f"Цифра в позиции десятков равна {num_3}")
# print(f"Цифра в позиции единиц равна {num_4}")


# Напишите программу, которая проверяет, что для заданного четырехзначного числа выполняется следующее соотношение
# сумма первой и последней цифр равна разности второй и третьей цифр.

# num = int(input())
# a = num // 1000 + num % 10
# b = num // 100 % 10 - num // 10 % 10
# if a == b:
#     print("ДА")
# else:
#     print("НЕТ")


# Напишите программу, которая определяет, разрешен пользователю доступ к интернет-ресурсу или нет.
# Формат входных данных
# На вход программе подаётся целое число — возраст пользователя.
# Формат выходных данных
# Программа должна вывести текст «Доступ разрешен» если возраст не менее 18, и «Доступ запрещен» в противном случае.

# user_age = int(input())
# if user_age >= 18:
#     print("Доступ разрешен")
# else:
#     print("Доступ запрещен")


# Напишите программу, которая определяет, являются ли три заданных числа (в указанном порядке)
# последовательными членами арифметической прогрессии.

a = int(input())
b = int(input())
c = int(input())

if c - b == b - a:
    print("Yes")
else:
    print("NO")
