print("Hello world")
# напишите программу которая считывает.
# строку - разделитель и три строки, а затем выводит указанные строки через разделитель.
# a = input()
# b = input()
# c = input()
# d = input()
# print(b, c, d, sep=a)


# Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек),
# после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.
# user = input()
# print("Привет, ", user.capitalize(), end="!")


# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
# Первое число вводит пользователь, остальные числа вычисляются в программе.
# user = int(input())
# print(user, user + 1, user + 2, sep="\n")


# Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
# Каждое число записано в отдельной строке.
# user_1, user_2, user_3 = int(input()), int(input()), int(input())
# print((user_1 + user_2 + user_3))


# Напишите программу, вычисляющую объём куба и площадь его полной поверхности,
# по введённому значению длины ребра.
# Примечание 1. Объём куба и площадь полной поверхности можно вычислить по формулам
# user = int(input())
# cube_volume = user ** 3
# total_surface_area = 6 * (user ** 2)
# print(f"Объём куда = {cube_volume}\nПлощадь полной поверхности = {total_surface_area}")


# Напишите программу вычисления значения функции (даётся формула)
# a = int(input())
# b = int(input())
# f = 3 * (a + b) ** 3 + 275 * b ** 2 - 127 * a - 41
# print(f)


# Напишите программу, которая считывает целое число
# после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.
# user = int(input())
# print(f"Следующее за числом {user} число: {user + 1}")
# print(f"Для числа {user} предыдущее число: {user - 1}")


# Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора
# системного блока, клавиатуры и мыши. На вход программе подаётся четыре целых числа
# каждое на отдельной строке
# В первой строке — стоимость монитора, во второй строке — стоимость системного блока,
# в третьей строке — стоимость клавиатуры и в четвертой строке — стоимость мыши.
# monitor_price = int(input())
# case_price = int(input())
# keyboard_price = int(input())
# mouse_price = int(input())
# total_price = monitor_price + case_price + keyboard_price + mouse_price
# print(f"{total_price * 3}")

# Напишите программу, в которой вычисляется сумма, разность и произведение двух целых чисел, в
# веденных с клавиатуры.
# a, b = int(input()), int(input())
# print(a + b, a - b, a * b, sep="\n")
